{
  "navbar":{
    "experience": "Experiencia",
    "projects": "Proyectos",
    "studies": "Estudios",
    "download": "Descargar CV"
  },
  "tec":{
    "mongodb1": "MongoDB es una base de datos distribuida, escalable y flexible.",
    "mongodb2": "Dato Curioso: El nombre 'MongoDB' viene de 'humongous' (enorme), por su capacidad de manejar grandes volúmenes de datos.",
    "express1": "Express es un framework minimalista para Node.js.",
    "express2": "Dato Curioso: Express es tan minimalista que muchos otros frameworks populares como NestJS están construidos sobre él.",
    "android-studio1": "El IDE oficial para el desarrollo de Android.",
    "android-studio2": "Dato Curioso: Está basado en IntelliJ IDEA de JetBrains, conocido por ser uno de los IDEs más inteligentes del mercado.",
    "angular1": "Plataforma de desarrollo creada por Google para apps web.",
    "angular2": "Dato Curioso: Angular fue reescrito completamente desde cero en 2016 (Angular 2), rompiendo compatibilidad total con AngularJS.",
    "asp1": "Tecnología de Microsoft para generar contenido dinámico.",
    "asp2": "Dato Curioso: ASP originalmente significaba 'Active Server Pages' y fue la primera respuesta de Microsoft a PHP.",
    "aws-ec21": "Servicio de capacidad informática redimensionable en la nube.",
    "aws-ec22": "Dato Curioso: EC2 fue uno de los primeros servicios lanzados por AWS en 2006, revolucionando la computación en la nube.",
    "aws-lambda1": "Ejecuta código sin aprovisionar ni administrar servidores.",
    "aws-lambda2": "Dato Curioso: Lambda popularizó el concepto de 'Serverless', permitiendo pagar solo por los milisegundos que tu código corre.",
    "aws-rds1": "Servicio de base de datos relacional gestionado.",
    "aws-rds2": "Dato Curioso: RDS automatiza tareas tediosas como copias de seguridad y parches, que antes consumían horas a los administradores.",
    "aws-s31": "Almacenamiento de objetos creado para recuperar cualquier cantidad de datos.",
    "aws-s32": "Dato Curioso: Se dice que S3 almacena billones de objetos y es la columna vertebral de gran parte de internet.",
    "bootstrap1": "Framework CSS más popular para sitios responsive.",
    "bootstrap2": "Dato Curioso: Originalmente se llamaba 'Twitter Blueprint' y fue creado por desarrolladores de Twitter.",
    "c-sharp1": "Lenguaje de programación moderno y seguro de Microsoft.",
    "c-sharp2": "Dato Curioso: Su nombre C# está inspirado en la notación musical, donde '#' indica un semitono más alto que la nota C.",
    "core1": ".NET Core es un framework multiplataforma y de código abierto.",
    "core2": "Dato Curioso: Fue el primer paso gigante de Microsoft para llevar .NET a Linux y Mac de forma nativa.",
    "css1": "Lenguaje de estilos para dar diseño a las páginas web.",
    "css2": "Dato Curioso: Una de las propuestas iniciales para CSS en 1994 incluía la capacidad de que el usuario controlara el estilo, no solo el autor.",
    "docker1": "Plataforma para desarrollar, enviar y ejecutar aplicaciones en contenedores.",
    "docker2": "Dato Curioso: Docker popularizó los contenedores, pero la tecnología subyacente (cgroups) existía en Linux mucho antes.",
    "figma1": "Herramienta de diseño de interfaces colaborativa.",
    "figma2": "Dato Curioso: Figma fue la primera herramienta de diseño construida para el navegador, permitiendo colaboración en tiempo real real.",
    "git1": "Sistema de control de versiones distribuido gratuito y de código abierto.",
    "git2": "Dato Curioso: Linus Torvalds creó Git en solo un fin de semana porque estaba frustrado con las herramientas existentes.",
    "html1": "Lenguaje de marcado estándar para documentos diseñados para ser mostrados en un navegador web.",
    "html2": "Dato Curioso: La primera versión de HTML creada por Tim Berners-Lee tenía solo 18 etiquetas.",
    "illustrator1": "Software de gráficos vectoriales estándar en la industria.",
    "illustrator2": "Dato Curioso: Illustrator comenzó en 1987, siendo uno de los primeros programas de software de Adobe.",
    "java1": "Lenguaje de programación orientado a objetos, robusto y seguro.",
    "java2": "Dato Curioso: Originalmente se llamaba 'Oak' (Roble) por un árbol que había fuera de la ventana del creador, James Gosling.",
    "javascript1": "Lenguaje de programación que permite actividades complejas en una página web.",
    "javascript2": "Dato Curioso: JavaScript fue creado por Brendan Eich en solo 10 días en 1995.",
    "jest1": "Marco de pruebas de JavaScript con un enfoque en la simplicidad.",
    "jest2": "Dato Curioso: Desarrollado por Facebook, Jest se usa masivamente para probar React, aunque funciona con cualquier proyecto JS.",
    "jira1": "Herramienta de gestión de proyectos para equipos ágiles.",
    "jira2": "Dato Curioso: El nombre JIRA proviene de 'Gojira', la palabra japonesa para Godzilla.",
    "jquery1": "Biblioteca de JavaScript rápida, pequeña y rica en funciones.",
    "jquery2": "Dato Curioso: En su apogeo, jQuery se usaba en más del 70% de los 10 millones de sitios web más populares.",
    "kanban1": "Método para gestionar el trabajo intelectual, con énfasis en la entrega justo a tiempo.",
    "kanban2": "Dato Curioso: Kanban se originó en las líneas de producción de Toyota en los años 40 para mejorar la eficiencia.",
    "laravel1": "Framework de aplicaciones web PHP con una sintaxis expresiva y elegante.",
    "laravel2": "Dato Curioso: Laravel fue creado como una alternativa más avanzada a CodeIgniter.",
    "lit-html1": "Biblioteca eficiente, expresiva y extensible para plantillas HTML en JavaScript.",
    "lit-html2": "Dato Curioso: Utiliza las características nativas del navegador (Template Literals) para ser extremadamente ligero y rápido.",
    "mockito1": "Marco de pruebas unitarias de código abierto para Java.",
    "mockito2": "Dato Curioso: Su nombre es un juego de palabras con la bebida 'Mojito' y la acción de hacer un 'mock' (simulacro).",
    "mysql1": "Sistema de gestión de bases de datos relacional de código abierto.",
    "mysql2": "Dato Curioso: El delfín del logo de MySQL tiene nombre: se llama 'Sakila'.",
    "nestjs1": "Framework para construir aplicaciones del lado del servidor eficientes y escalables con Node.js.",
    "nestjs2": "Dato Curioso: NestJS está fuertemente inspirado en Angular, usando módulos, controladores e inyección de dependencias.",
    "node1": "Entorno de ejecución para JavaScript construido con el motor V8 de Chrome.",
    "node2": "Dato Curioso: Ryan Dahl creó Node.js porque quería una forma de saber cuánto progreso llevaba una subida de archivos en tiempo real.",
    "photoshop1": "Software de edición de imágenes y diseño gráfico.",
    "photoshop2": "Dato Curioso: Photoshop 1.0 se lanzó exclusivamente para Macintosh en 1990 y venía en un disquete.",
    "php1": "Lenguaje de script de propósito general especialmente adecuado para el desarrollo web.",
    "php2": "Dato Curioso: PHP significaba originalmente 'Personal Home Page' (Página de Inicio Personal).",
    "postman1": "Plataforma API para construir y usar APIs.",
    "postman2": "Dato Curioso: Comenzó como una simple extensión de Chrome hecha por un desarrollador para facilitar su propio trabajo.",
    "react1": "Biblioteca de JavaScript para construir interfaces de usuario.",
    "react2": "Dato Curioso: Creado inicialmente para el feed de noticias de Facebook y luego liberado como Open Source in 2013.",
    "rest1": "Estilo de arquitectura de software para sistemas hipermedia distribuidos.",
    "rest2": "Dato Curioso: REST fue definido por Roy Fielding en su tesis doctoral en el año 2000.",
    "sass1": "Extensión de CSS que añade poder y elegancia al lenguaje básico.",
    "sass2": "Dato Curioso: SASS significa 'Syntactically Awesome Style Sheets' (Hojas de Estilo Sintácticamente Asombrosas).",
    "scrum1": "Marco de trabajo ágil para gestionar proyectos complejos.",
    "scrum2": "Dato Curioso: El término 'Scrum' viene del rugby, refiriéndose a una formación donde el equipo trabaja junto para avanzar.",
    "soap1": "Protocolo estándar para el intercambio de información estructurada.",
    "soap2": "Dato Curioso: SOAP era el estándar dominante antes de REST, conocido por ser muy estricto y verboso.",
    "spring-boot1": "Facilita la creación de aplicaciones stand-alone basadas en Spring.",
    "spring-boot2": "Dato Curioso: Spring Boot revolucionó el ecosistema Java al eliminar la infame configuración XML masiva.",
    "spring1": "Framework de aplicación y contenedor de inversión de control para la plataforma Java.",
    "spring2": "Dato Curioso: Su primera versión fue lanzada en 2003 como una alternativa ligera al complejo estándar J2EE.",
    "sql-server1": "Sistema de gestión de bases de datos relacional desarrollado por Microsoft.",
    "sql-server2": "Dato Curioso: Originalmente fue desarrollado para ejecutarse en OS/2, no en Windows.",
    "sql1": "Lenguaje específico del dominio utilizado en programación para gestionar datos.",
    "sql2": "Dato Curioso: Originalmente se llamaba SEQUEL (Structured English Query Language), pero cambiaron el nombre por una marca registrada.",
    "trello1": "Aplicación de gestión de proyectos basada en el método Kanban.",
    "trello2": "Dato Curioso: El nombre 'Trello' viene de la palabra 'Trellis' (enrejado), simbolizando estructura.",
    "typescript1": "Superconjunto tipado de JavaScript que se compila a JavaScript plano.",
    "typescript2": "Dato Curioso: Fue creado por Anders Hejlsberg, el mismo arquitecto principal detrás de C# y Turbo Pascal.",
    "vbscript1": "Lenguaje de script activo modelado sobre Visual Basic.",
    "vbscript2": "Dato Curioso: Fue muy popular para virus informáticos en los 2000s, como el famoso virus 'ILOVEYOU'.",
    "visual-studio-code1": "Editor de código fuente ligero pero potente.",
    "visual-studio-code2": "Dato Curioso: A pesar de ser de Microsoft, está construido usando tecnologías web (Electron) y es Open Source.",
    "visual-studio1": "IDE de Microsoft para desarrollo de software.",
    "visual-studio2": "Dato Curioso: La primera versión, Visual Studio 97, consolidó por primera vez herramientas como Visual Basic y Visual C++ en un solo entorno.",
    "wordpress1": "Sistema de gestión de contenidos enfocado en la creación de cualquier tipo de página web.",
    "wordpress2": "Dato Curioso: Alimenta más del 40% de todos los sitios web en internet."
  },
  "info-exp":{
    "full": "Desarrollador Full Stack",
    "front": "Desarrollador Front-End",
    "back": "Desarrollador Back-End",
    "support": "Especialista de Soporte"
  },
  "nttdata":{
    "date": "Julio 2021 - Presente",
    "desc1": "NTT DATA, parte de NTT Group, es uno de los 10 principales proveedores de servicios de TI a nivel mundial.",
    "desc2": "Ofrecen servicios de consultoría, soluciones industriales, servicios de procesos de negocio, modernización de TI y servicios gestionados.",
    "task1": "Desarrollo deL backend haciendo uso de Java Spring",
    "task2": "Creación, mantenimiento y mejora de diversos componentes para el front-end haciendo uso de Angular13",
    "task3": "Desarrollo de microservicios haciendo uso de Java Spring Boot",
    "task4": "Gestión de contenedores haciendo uso de Docker",
    "task5": "Creación y mantenimiento de diversos componentes para el front-end haciendo uso de Angular13",
    "task6": "Creación de microservicios haciendo uso de node js con funciones lambda - AWS",
    "task7": "Gestión de bases de datos MySQL con el servicio RDS - AWS",
    "task8": "Agregando módulos para el front-end haciendo uso de Lit-Html (JS)",
    "task9": "Recreación del front-end del sistema silverlight haciendo uso de Angular11",
    "task10": "Test de módulos haciendo uso de jest.js",
    "task11": "Consumo de API REST"
  },
  "renfe":{
    "date": "Noviembre 2022 - presente",
    "desc1": "Plataforma de administración de las vías ferroviarias y trenes de España, incluyendo rutas, cargas, estaciones, etc.",
    "desc2": "Tecnologías usadas: Java Spring - Angular13.",
    "task1": "Desarrollo deL backend haciendo uso de Java Spring",
    "task2": "Creación, mantenimiento y mejora de diversos componentes para el front-end haciendo uso de Angular13"
  },
  "datadis":{
    "date": "Febrero 2022 - Octubre 2022",
    "desc1": "Es una plataforma de datos de consumo eléctrico que permite al administrador ver, agregar, editar y eliminar diversas empresas y sus consumos eléctricos a una base de datos mediante una API y a los usuarios en general verificar el consumo eléctrico en diversos periodos de tiempo.",
    "desc2": "Tecnologías usadas: Java Spring Boot - Docker - Angular13.",
    "task1": "Desarrollo de microservicios haciendo uso de Java Spring Boot",
    "task2": "Gestión de contenedores haciendo uso de Docker",
    "task3": "Creación, mantenimiento y mejora de diversos componentes para el front-end haciendo uso de Angular13"
  },
  "ree":{
    "date": "Diciembre 2021 - Enero 2022",
    "desc1": "Sistema administrativo y dashboard para la red eléctrica de España.",
    "desc2": "El sistema permite a la población en general verificar su consumo eléctrico mediante diversos gráficos.",
    "desc3": "Tecnologías usadas: Node js - lambda(AWS) -  RDS(AWS) - MySQL - LitHtml(JS).",
    "task1": "Creación microservicios haciendo uso de node js con funciones lambda - AWS",
    "task2": "Gestión de bases de datos MySQL con el servicio RDS - AWS",
    "task3": "Agregando módulos para el front-end haciendo uso de Lit-Html (JS)"
  },
  "ibost":{
    "date": "Julio 2021 - Noviembre 2021",
    "desc1": "El proyecto consistía en la migración de un sistema basado en Silverlight a un nuevo proyecto usando la tecnología Angular11.",
    "desc2": "iBost es una empresa que se dedica a la distribución de diversas resistencias eléctricas y su sistema requería una administración de pedidos y clientes.",
    "desc3": "Tecnologías usadas: jest.js - API REST - Angular11.",
    "task1": "Recreación del front-end del sistema silverlight haciendo uso de Angular11",
    "task2": "Test de módulos haciendo uso de jest.js",
    "task3": "Consumo de API REST"
  },
  "adiasoft":{
    "date": "Enero 2022 - Abril 2022",
    "desc1": "Es un Software de ventas entorno ERP, para una gestión automatizada y administrativa para pequeñas y medianas empresas.",
    "desc2": "El proyecto consistía en crear una plataforma orientada a la facturación electrónica que se pueda integrar tanto en los sistemas antiguos como en los actuales.",
    "desc3": "Tecnologías usadas: Java Spring Boot - React - SQL server.",
    "task1": "Adaptación de un sistemas de Facturación Electrónica haciendo uso de React",
    "task2": "Desarrollo API REST con Java Spring Boot",
    "task3": "Creación de tablas, triggers e índices SQL server"
  },
  "webControl":{
    "date": "Septiembre 2020 - Julio 2021",
    "desc1": "WebControl System es una empresa del área de tecnologías de la información, principalmente orientada a empresas de minería.",
    "desc2": "El sistema está orientado a la gestión del negocio, proporcionando herramientas como reportes, control de envíos, Kardex, CRUDs, etc.",
    "desc3": "Tecnologías usadas: Visual Basic Script - ASP.NET - SQL server - .NET CORE.",
    "task1": "Administración de bases de datos usando SQL Server",
    "task2": "Desarrollo Front-End haciendo uso de VBScript / ASP.NET",
    "task3": "Desarrollo Back-End API REST con .NET CORE"
  },
  "orooplex":{
    "date": "Septiembre 2019 - Agosto 2020",
    "desc1": "Orooplex es un servicio web orientado a anuncios empresariales, publicidad y marketing digital.",
    "desc2": "Tecnologías usadas: React - Angular - Node.Js - Express - MySQL.",
    "task1": "Creación de paginas web enfocadas a la publicidad y el marketing",
    "task2": "Desarrollo Front-End haciendo uso de React / Angular",
    "task3": "Desarrollo Back-End API REST con MySQL / Express / Node.Js"
  },
  "frs":{
    "date": "Enero 2020 - Abril 2020",
    "desc1": "Francisco Rojas School es una institución educativa particular.",
    "desc2": "El especialista de soporte se encarga de publicidad, mantenimiento y desarrollo de la pagina web de la institución y mantenimiento de los equipos digitales en la instalación.",
    "desc3": "Tecnologías usadas: wordpress - Adobe Illustrator - Adobe Photoshop",
    "task1": "Creación de las diversas publicidades y anuncios de la institución haciendo uso de Adobe Illustrator y Photoshop",
    "task2": "Administración y creación de componentes de la pagina web haciendo uso de Wordpress",
    "task3": "Mantenimiento de dispositivos digitales de las instalaciones"
  },
  "andromeda":{
    "date": "Febrero 2019 - Agosto 2019",
    "desc1": "Andromeda.Pe es una empresa que se dedica al desarrollo de aplicaciones web mayormente orientadas a la facturación electrónica.",
    "desc2": "Tecnologías usadas: Laravel - MySQL",
    "task1": "conexión con API de SUNAT para el CRUD de boletas y facturas en su sistema",
    "task2": "Administración de bases de datos haciendo uso de MySQL",
    "task3": "Creación y mantenimiento de lógica de negocio haciendo uso de Laravel - php"
  },
  "auditel":{
    "date": "Diciembre 2018 - Febrero 2019",
    "desc1": "Auditel es un mayorista en telecomunicaciones y seguridad.",
    "desc2": "Implementa hardware y software de seguridad a diversas instituciones.",
    "desc3": "Tecnologías usadas: React - Express - Node.Js - MongoDB",
    "task1": "Creación de una pagina web en la que alumnos podrán realizar diversas acciones como ver notas, registrar entradas, ver mensajes, etc ",
    "task2": "Creación de diversos componentes usando React",
    "task3": "Creación de lógica de negocio haciendo uso de Express",
    "task4": "Administración de bases de datos haciendo uso de MySQL"
  },
  "cv": {
    "headers": {
      "profile": "Perfil Profesional",
      "experience": "Experiencia",
      "certifications": "Certificaciones y Formación",
      "skills": "Aptitudes",
      "technologies": "Tecnologías y Herramientas"
    },
    "profile": {
      "name": "Renzo Davila",
      "role": "Arquitecto-DESARROLLADOR de Sistemas & Especialista en Soluciones de IA",
      "contact": "renzo.davila.acosta@gmail.com | +51 949691327 | linkedin",
      "summary": "Ingeniero de Sistemas y Desarrollador Senior con más de 8 años de experiencia en banca y consultoría corporativa. Especialista en la modernización de arquitecturas legacy y en la implementación de ecosistemas de Inteligencia Artificial."
    },
    "jobs": {
      "indra": {
        "date": "Agosto 2025 - Actualmente",
        "role": "Desarrollador CELLS",
        "company": "INDRA",
        "tasks": [
          "Implementar y evolucionar componentes Cells usando Lit v3 (web components, reactive properties, templates eficientes).",
          "Mantener y corregir componentes existentes en Polymer 2, asegurando compatibilidad y estabilidad.",
          "Integracion de agentes IA",
          "Optimizar el ciclo de desarrollo mediante el uso de GitHub Copilot y asistentes de IA",
          "Crear wrappers/adaptadores para interoperar Lit v3 con Polymer 2 mientras se migra el catálogo.",
          "Planificar y ejecutar la migración de Polymer 2 a Lit v3 (refactor de templates, estilos, ciclos de vida, eventos).",
          "Identificar dependencias legacy, riesgos y deuda técnica; proponer planes de deprecación y sustitución.",
          "Garantizar compatibilidad con ShadyDOM/Shadow DOM y ES Modules en navegadores objetivo.",
          "Consumir y aplicar design tokens, tipografías, paleta y theming del sistema de diseño de BBVA.",
          "Alinear comportamiento y look & feel con UX/UI, prototipos y guías de accesibilidad."
        ]
      },
      "nyutku": {
        "date": "Noviembre 2024 - Actualmente",
        "role": "Lead AI Architect & Developer",
        "company": "NYUTKU SYSTEMS",
        "tasks": [
          "Desarrollo de Ecosistemas de Agentes IA: Creación de asistentes autónomos utilizando LangChain y Python, integrando memoria conversacional y razonamiento lógico para la toma de decisiones empresariales.",
          "Orquestación de Procesos (BPA): Implementación de flujos de trabajo complejos en n8n (Self-hosted en Docker), automatizando la captación de leads, atención al cliente y gestión documental.",
          "Infraestructura & Datos: Despliegue de bases de datos vectoriales con Supabase y PostgreSQL para sistemas RAG (Retrieval-Augmented Generation). Administración de servidores VPS (Hostinger/AWS) y contenedores Docker.",
          "Omnicanalidad Avanzada: Integración de APIs de mensajería masiva (Evolution API, WAHA) y flujos de ventas en ManyChat.",
          "IA de Voz: Implementación de agentes telefónicos con síntesis de voz ultra-realista (ElevenLabs) para automatización de llamadas.",
          "Desarrollo de dashboard con Next.js potenciado con herramientas de IA para la administracion de negocios",
          "Analisis de negocio e implementacion de IA para optimizar procesos y garantizar"
        ]
      },
      "stefanini": {
        "date": "Diciembre 2022 – Junio 2025",
        "role": "Analista desarrollador Fullstack",
        "company": "Stefanini LATAM",
        "tasks": [
          "Automatización de Operaciones: Desarrollo de scripts en Python y flujos en n8n para reducir la carga manual en la generación de reportes y monitoreo de sistemas.",
          "Integración de LLMs: Prototipado de asistentes internos utilizando LangChain para consulta de bases de conocimiento corporativas.",
          "Migración de aplicaciones de Angular.js a versiones modernas de Angular.",
          "Creación y mantenimiento de interfaces de usuario utilizando Angular (versión 2 y superiores) y React.js.",
          "Gestión de versiones de código utilizando Bitbucket y Git.",
          "Desarrollo de aplicaciones móviles con Ionic.",
          "Implementación de atributos de accesibilidad en etiquetas HTML siguiendo la especificación WAI-ARIA.",
          "Reuniones y proyectos siguiendo el marco SCRUM",
          "Participación en la definición de la arquitectura de software para proyectos web, asegurando la escalabilidad y mantenibilidad del código.",
          "Diseño y desarrollo de aplicaciones móviles multiplataforma utilizando tecnologías como Ionic o React Native.",
          "Mantenimiento y creación de funcionalidades con java"
        ]
      },
      "nttdata_new": {
        "date": "Julio 2021 – Diciembre 2022",
        "role": "Center Developer",
        "company": "NTT DATA Europe & Latam",
        "tasks": [
          "Creación y mantenimiento de microservicios Serverless con Node.js y AWS Lambda.",
          "Creación y mantenimiento de Interfaces de usuario haciendo uso de Angular 2",
          "Gestión de versiones con Bitbucket/Git",
          "Mantenimiento y creación de microservicios con NodeJS y funciones lambda-AWS",
          "Gestión de BD y archivos con RDS-AWS/S3-AWS",
          "Testing con Karma(unitarias) y Cypress(end-to-end)",
          "Optimización del rendimiento de las aplicaciones web, realizando análisis y ajustes en el código y la base de datos.",
          "Mantenimiento y creación de microservicios utilizando Spring Framework y Node.js."
        ]
      },
      "webcontrol_new": {
         "date": "Septiembre 2020 – Julio 2021",
         "role": "Desarrollador Web",
         "company": "Webcontrol Corp.",
         "tasks": [
            "Administración de bases de datos utilizando SQL Server.",
            "Creación y mantenimiento de interfaces de usuario utilizando VBScript y ASP.NET.",
            "Desarrollo y mantenimiento de API REST con .NET Core.",
            "Colaboración con equipos de diseño y producto para implementar soluciones centradas en el usuario y mejorar la experiencia del cliente.",
            "Creación de documentación técnica y guías de usuario para facilitar la integración y uso de nuevas funcionalidades por parte del equipo y los clientes."
         ]
      },
      "adiasoft_new": {
        "date": "Enero 2021 – Abril 2021",
        "role": "Desarrollador Full Stack",
        "company": "ADIASOFT E.I.R.L",
        "tasks": [
          "Adaptación de un sistema de facturación electrónica utilizando React.",
          "Desarrollo de API REST con Java Spring Framework.",
          "Creacion de microservicios con SpingBoot",
          "Creación de tablas, triggers e índices en SQL Server.",
          "Uso de git para gestion de versiones",
          "Implementación de metodologías de desarrollo de software, como DevOps, para mejorar la eficiencia en el ciclo de vida del desarrollo."
        ]
      },
      "orooplex_new": {
        "date": "Septiembre 2019 – Agosto 2020",
        "role": "Desarrollador Web",
        "company": "Orooplex",
        "tasks": [
          "Creación de páginas web enfocadas en publicidad y marketing.",
          "Desarrollo y mantenimiento de interfaces de usuario utilizando React y Angular.",
          "Creación y mantenimiento de API REST con Express.js y Node.js.",
          "Gestión de bases de datos utilizando MySQL."
        ]
      },
      "frs_new": {
        "date": "Enero 2020 – Abril 2020",
        "role": "Especialista en Soporte",
        "company": "I.E.P. Francisco Rojas School",
        "tasks": [
          "Gestión de publicidad y creación de anuncios para la institución utilizando Adobe Illustrator y Photoshop.",
          "Desarrollo y mantenimiento de interfaces de usuario con WordPress.",
          "Mantenimiento de dispositivos digitales."
        ]
      },
      "andromeda_new": {
        "date": "Febrero 2019 – Agosto 2019",
        "role": "Back-end Developer",
        "company": "Andromeda.pe S.A.C",
        "tasks": [
          "Conexión con la API de SUNAT para el manejo de CRUD de boletas y facturas en el sistema.",
          "Administración de bases de datos utilizando MySQL.",
          "Creación y mantenimiento de la lógica de negocio utilizando Laravel y PHP."
        ]
      }
    },
    "certifications": [
      "Complete Kanban from A to Z – Udemy (Nov 2025).",
      "Kanban Essentials with AI Certified – VMEdu (Oct 2025).",
      "Business Analysis Fundamentals with AI Certified – VMEdu (Oct 2025).",
      "OKR Fundamentals with AI Certified – VMEdu (Oct 2025).",
      "Scrum & Agile Certification – Udemy (Oct 2025).",
      "ScrumFundamentalsCertified – VMEdu (Sep 2025).",
      "The DevOps Essentials - The Handbook – Udemy (Oct 2025).",
      "AWS Cloud Practitioner – AWS (Ene 2024 – Mar 2024).",
      "Marketing Strategy Fundamentals – SMstudy (Oct 2025).",
      "Corporate Sales Fundamentals – SMstudy (Oct 2025).",
      "Digital Marketing Fundamentals – SMstudy (Oct 2025).",
      "Marketing Research Fundamentals – SMstudy (Oct 2025)."
    ],
    "skills": [
      "Administración de proyectos",
      "Análisis de datos",
      "Pensamiento Crítico",
      "Resolución de Problemas",
      "Adaptabilidad",
      "Gestión del Tiempo"
    ],
    "technologies": "Inteligencia Artificial & Automatización: LangChain | n8n (Workflow Automation) | Python | OpenAI API | Claude API | ElevenLabs | Supabase (Vector DB) | PostgreSQL | WAHA / Evolution API (WhatsApp) | ManyChat | GitHub Copilot.\nDesarrollo Fullstack & Móvil: Angular (v2+) | React.js | Node.js | Express.js | Java Spring Boot | Ionic | React Native | Lit v3 (Web Components).\nCloud & DevOps: AWS (Lambda, S3, RDS, EC2) | Docker | Portainer | VPS Administration (Linux) | Git | Bitbucket | CI/CD Pipelines."
  }
}
